app/views/users/show.html.erb

SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."user_id" = 8
---
	</tr>
	<% @user.authorizations.each do |authorization| %>