app/controllers/sessions_controller.rb

SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."provider" = 'salesforce' AND "authorizations"."uid" = 'https://login.salesforce.com/id/00D6F000001ezcZUAQ/0056F000006Qd89QAC' LIMIT 1
SELECT 1 FROM "users" WHERE LOWER("users"."email") = LOWER('sandeep@freshdesk.com') LIMIT 1
INSERT INTO "authorizations" ("created_at", "provider", "refresh_token", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "privilege", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
	auth_hash = request.env['omniauth.auth']
	puts "auth_hash #{auth_hash.to_json}"
	if auth_hash
		puts "auth_hash #{auth_hash['info']}"
		flash[:success] = "through provider you are successfuly loggedin to the Sample App!"

		@authorization = Authorization.find_by_provider_and_uid(auth_hash['provider'], auth_hash['uid'])
		if @authorization
			puts "auth find ======="
			user = @authorization.user
			sign_in user
			flash[:success] = "User is saved in sample App"
			redirect_back_or user
		else
			user = User.find_by_email(auth_hash['info']['email'])
			puts "user find =======#{user}"
			if user
				Authorization.createProvider(auth_hash['provider'], auth_hash['uid'], user)