app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def create

  	auth_hash = request.env['omniauth.auth']
  	puts "auth_hash #{auth_hash}"
  	if auth_hash

		if session[:authuser_id] && ((session[:authuser_id]).is_a? String)

		    # Means our user is signed in. Add the authorization to the user
		    auser = Authuser.find(session[:authuser_id]).add_provider(auth_hash)