app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "privilege", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "encrypted_password" = 'edb21bcde19768a4b1e635c8db08290389cbb2a7d0246deea610912077986e25', "updated_at" = '2017-02-16 07:42:40.185485' WHERE "users"."id" = 1

	def index
		@users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"